Revit 2027 API
PrintSetup.Rename Method
Rename the current print setting with the specified name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool Rename(
	string newName
)
Public Function Rename (
	newName As String
) As Boolean
public:
bool Rename(
	String^ newName
)
member Rename :
        newName : string -> bool
Parameters
newName String
print setting name to be renamed as.
Return Value
Boolean
False if Rename operation fails, otherwise true.
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when the input newName already exists in current print setting list.
See Also
Reference
PrintSetup Class
Autodesk.Revit.DB Namespace